BankXml/RTGS_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.com" xmlns:ns3="http://strukturaRtgsNaloga.com" xmlns:ns4="http://mt102.BankXml.bankXml.example.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>M0GSHdXKHLlxWrxwR6OkDH6fmSjJnrT5Ks/5N6NSdpVq2S9P5+DttornzzD0l5VTcRErUKuHK8GR&#13;
ssnKmerdnV4aXTuaVZXteiA0wJpukDWJxPEKVsZ1KYurs8jNcVYPKvq+w7j6e8AJgfz4g4/Zql2J&#13;
xCm+5qFzKeiZDux4hHt8ahmFrujb9R+xP2FQ7qzWtdrshRLL34Ho5RQeWhsAaI1rpmb6eBaEpPIM&#13;
yXe3fxzybx57QfrQtGKeIuSSuvGYUKOBR1cp1h3Qx0PUu5S1miQwT8C+FPUKT+Q9zhiiIw0WXq/f&#13;
c2H3ROgp15Pb7FwWunSdQ6aPFXCSDouxN5XlPA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>Xxgny2T1bY2/PS2iw/cVnwOUemcvOjxoaRpWoc5gMpRbC768WQ6yxcHXZxK2Ar5dY73hcoy+FLbI&#13;
WiOY1Ng4WB06r4fgwKr6+balheSUAoBnUw0sLZ8exQJqvjbmqD5z+1wvgQBrqYtBRH+YItMRiwed&#13;
iaWJLRz8TK9usMCoOgGD8iZEKt0AV3rIqQQDWsoxIFTB0HvwlJI/9nETmker14128idC5D501Plf&#13;
8t3FfLVk45lPBbbd6GBrPnyL7TP5z5c00868fYewS5CJk+23NUJo4ElAVirdv7Aoac6gGAIZvvE3&#13;
LXx5ZZpHYVwNZnVn4YJTAXeO66KQ5O65ln6L7T12/UGKkaRvWVextl8HrAf6sOXyhKf60sr9LDzP&#13;
p3t2ekRUjiqj6q2fG0OU6264FR0Z1l/FDaN+qGHzVmlC80kNhXdpAmCT4FCZWB9K/P03rn+ng0rm&#13;
O+DCG9P4GlRtNrYG98ltJrSKjhCz/ybVK+foq49r5TxndcQVbbpmeGFR6r2Ajdyuceg48QD/4ofz&#13;
OiVsuAAOzUUN1UVhoPy1lodo2tV0XyAUC1gzH4+Bf31Qt/+1kH8ygkk7MptJGdVYXavHLvurBZW7&#13;
wLUpAt8tsle6y8D21CxKnez52ADYy7aKNGMFNmpgj9kv/9BaF+torN8Xoo8UYvyNPjigL1jZbATu&#13;
hadO6OxI3zBnRdZerqe3u044XavWIQ7GOoMKUAfWPrqk2QiTKkmh3fmprESy4tpLEkju9r7BiqRp&#13;
07N6oezCZGI38h2nsG9oZwFSXDCQ9IdAvM7ZDKiwfHbA1VCmvI7MQbfma1tdWCqpAnayjm1XBLE+&#13;
Xh25SQDKMcuvk7PDXxLCiMH+y/eZnOaX+sLsexuiK/ltTOvp6Q7MAdJltEQbM8yvWs8lKNZsFbwV&#13;
goiSkrtGmDgIlFsDYl1aSuvxOlPINHNJDE0MugxPqx2FNqxzXvedX/xmDsk8F08OTHJV1viXv5ze&#13;
K+XZDKe9vrJis9JFoema/K48VpqHZ1W/V27/duGeTpXgTLccxha6Jw+odOzpf2OJpBH2p2+bT900&#13;
ImUGJg8A/O2nkc2HYO/uAiqz78JmDXimfyoLW0Kkw/mGtyT0GM34Bqz7+WzlbUYTSGDD0aTTC1Zq&#13;
x5NKZxqTtbmTaaYOPalUkBDCgQIuLXJAro69xzbMDx1nVaQ/WZo67Dmo2AWyVu5kTE8+FnaCal8l&#13;
3jWeiEw9ditYgWqMODs7desc3TGnpdBrDWeUq7YgpMUMYm+yxEK+g1NkpqOFs8+yKUh+JIcRpdim&#13;
/zN9mNLmOss3TVU4ae/Li5WmpYfnuemA0mEsVut5uEiX2pW9GuRXsAz82A5dGGStlHnPo3fVLw==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>AZCSr/oogKku3XRUjCd3MxkSkY4=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
g/CEXg/gjFsRW4yhAlvIDnKVpU0kbYHVobz1ZzHzDr/w379K9ycVwYU5WPiiq0TvSJdMScYvos29&#13;
vXmJ8z8apZ03LxfOEuDz5X58AHiHsgGT92faIn3HSNw5+UfXOhuECbszC9oPW7bbmA8vfAw118Rk&#13;
CBsDc0IIH3t9vvHG9nI6V/x9XK4sLnyRuoWdvAnAFAwDqJawoJYXKwqrzFtbbn6QZGbfhS4gp7qG&#13;
/AGUnaQ7JeB8t5tj2/Y465QIjNoDyHTlQj0ihBcswXc6fDPSr08cwzORTqI077vPNbk5+hdXZd4p&#13;
bpRuPC0sPYxYN2DA6n9qo2FoYwwa1LjLsXg4aQ==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>